create_clock -name MYCLK -per 10 [get_ports clk];
set_clock_latency -source 2 [get_clocks MYCLK];
set_clock_latency 1 [get_clocks MYCLK];
set_clock_uncertainty -setup 0.5 [get_clocks MYCLK];
set_clock_uncertainty -hold 0.1 [get_clocks MYCLK];
set_input_delay -max 0.5 -clock [get_clocks MYCLK] [get_ports p];
set_input_delay -max 0.5 -clock [get_clocks MYCLK] [get_ports s];
set_input_delay -max 0.5 -clock [get_clocks MYCLK] [get_ports sr];
set_input_delay -max 0.5 -clock [get_clocks MYCLK] [get_ports sl];
set_input_delay -max 0.5 -clock [get_clocks MYCLK] [get_ports reset];
set_input_delay -min 0.1 -clock [get_clocks MYCLK] [get_ports p];
set_input_delay -min 0.1 -clock [get_clocks MYCLK] [get_ports s];
set_input_delay -min 0.1 -clock [get_clocks MYCLK] [get_ports sr];
set_input_delay -min 0.1 -clock [get_clocks MYCLK] [get_ports sl];
set_input_delay -min 0.4 -clock [get_clocks MYCLK] [get_ports reset];
set_input_transition -max 0.4 [get_ports p];
set_input_transition -max 0.4 [get_ports s];
set_input_transition -max 0.4 [get_ports sr];
set_input_transition -max 0.4 [get_ports sl];
set_input_transition -max 0.4 [get_ports reset];
set_input_transition -min 0.1 [get_ports p];
set_input_transition -min 0.1 [get_ports s];
set_input_transition -min 0.1 [get_ports sr];
set_input_transition -min 0.1 [get_ports sl];
set_input_transition -min 0.1 [get_ports reset];
create_generated_clock -name MYGEN_CLK -master MYCLK -source [get_ports clk] -div 1 [get_ports out_clk];
set_output_delay -max 0.4 -clock [get_clocks MYGEN_CLK] [get_ports q];
set_output_delay -min 0.1 -clock [get_clocks MYGEN_CLK] [get_ports q];
set_load -max 0.17 [get_ports q];
set_load -min 0.1 [get_ports q];

